{
  "Header.Item1": "About me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Achievement",
  "Header.Item5": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "CV_Nikhil_Janshali.pdf",
  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "With over <span class='underline'>10 years of experience</span> in web design and development, I have honed my skills in structure, functionality, configuration, testing, delivery, and maintenance. My expertise extends to web application design, architecture, implementation, and integration. I am known for being a responsible, intelligent professional who is process-oriented, a fast learner, and a self-starter. I excel in problem-solving and stay updated with the latest technologies and standards. Possessing excellent communication skills, I work effectively both independently and as a productive team member, capable of taking on leadership and mentoring roles. My motivation and commitment to excellence make me a valuable asset in any professional setting.",
  "Banner.ActionBtn": "Get in touch",
  "AboutMe.Title": "About me",
  "AboutMe.Paragraphs": [
    "In <span class='underline'>10 years of experience</span> I've covered many roles: <span class='underline'>System Analyst</span>, <span class='underline'>Frontend Developer</span>, <span class='underline'>Backend Developer</span> and <span class='underline'>Technical Leader</span>. I love contributing my knowledge to create new things that help solve problems.",
    "My capabilities also include implementing improvements in systems, optimizing sites, standardizing patterns, and suggesting and executing ideas that add value to the project I'm working on.",
    "I also program things for my personal use, whether as a hobby or for utility. I seek to train every day. I have worked writing <span class='underline'>unit tests</span>, <span class='underline'>performing continuous integration</span>, and covering backend developer roles with <span class='underline'>ExpressJS, NestJs, MongoDB and Mysql</span>. I have led teams having empathy, exercising motivation to partners, and setting plans and goals together.",
    "My skills also include implementing system improvements, optimizing sites, standardizing patterns, and suggesting and executing ideas that add value to the project I'm working on.",
    "Some of the technologies that I have trained and worked on include (but are not limited to):"
  ],
  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "ShrunTech",
      "Title": "Angular Tech. Lead",
      "Date": "May 2023",
      "Description": [
        "Technical decision leader",
        "Technical talent recruitment for the company",
        "Department of Technology team leader",
        "Creation and maintenance of an internal process management platform for sales courses",
        "Programming of custom functions and plugins for customization of a WordPress platform",
        "Implementation of continuous integration and daily backups.",
        "Planning meetings with reports."
      ]
    },
    {
      "Tab": "Moon Technology",
      "Title": "Angular Team Lead",
      "Date": "Feb 2023 - Jan 2024",
      "Description": [
        "Enhanced Angular application efficiency by 20% through strategic package optimization, eliminating unnecessary components from existing upgrades.",
        "Directed and oversaw the daily activities of team members, ensuring effective work prioritization and maintaining high quality standards.",
        "Provided mentorship and coaching to team members, fostering successful performance and skill development.",
        "Delegated tasks based on project requirements and individual strengths, optimizing resource allocation.",
        "Collaborated with management to prioritize assignments in alignment with current issues and business priorities.",
        "Facilitated communication among team members, promoting increased productivity and meeting weekly deadlines.",
        "Engineered a customized Angular module for a client, reducing development time by 40% and enhancing team productivity by 25%.",
        "Teamed up with the back-end development team to construct a RESTful API, resulting in a 30% improvement in overall application performance and reduced load times."
      ]
    },
    {
      "Tab": "GSD",
      "Title": "Angular Consultant ",
      "Date": "Dec 2021 - Jan 2023",
      "Description": [
        "Architected, developed, and designed a web application using Angular 10, later migrating it to Angular 12 with TypeScript.",
        "Played a key role in crafting responsive web design using HTML, CSS, SASS (variables), and Flexbox.",
        "Implemented Promises and Observables for asynchronous/synchronous services as needed.",
        "Integrated Telerik & Kendo UI for efficient data representation, filtering, and other UI elements.",
        "Utilized Lazy loading and parameterization for passing data through the Router module, including activatedRoute.",
        "Engineered the HTTP client to interact with the server/backend and modularized the application with the Ng Module.",
        "Employed Angular routers, CanActivate, and CanDeactivate routes for seamless navigation between tiles/pages.",
        "Developed custom pipes and directives to optimize data transformation for a real-time user experience.",
        "Implemented NgRx for managing session state, user authentication, and administrative access and functionality.",
        "Created a notification service utilizing RxJS subjects and SMTP services to send daily stock, sales, and purchase information via email.",
        "Established cross-component communications using @Output and @Input decorators.",
        "Collaborated closely with back-end developers to integrate RapNET data, ensuring the availability of the latest details about diamonds to support daily sales and purchase operations.",
        "Designed and implemented administrative dashboards displaying real-time statistics and pricing using chart.js.",
        "Conducted manual testing in adherence to the Test Driven Development (TDD) environment after code implementation."
      ]
    },
    {
      "Tab": "GGC",
      "Title": "Sr. Software Developer",
      "Date": "April 2016 - Nov 2021",
      "Description": [
        "Identified and executed codebase improvements to enhance overall code quality.",
        "Implemented responsive design principles, utilizing Angular Material, Twitter Bootstrap, CSS/SCSS, and media queries to ensure seamless mobile compatibility for web applications.",
        "Integrated third-party APIs into web applications through RESTful services and AJAX calls.",
        "Developed single-page applications using AngularJS, HTML5, CSS3, and JavaScript.",
        "Engineered reusable components to expedite the development of new features in subsequent projects.",
        "Led the migration of legacy applications from older technologies to modern frameworks like Angular 8+, contributing to the creation of high-quality code for diverse projects.",
        "Provided routine coaching and training to newly hired software engineers, offering mentorship for their professional development.",
        "Leveraged APIs to supply data to web applications, optimizing functionality.",
        "Managed concurrent involvement in multiple projects, delivering short-term project services.",
        "Conducted thorough code reviews to ensure adherence to quality standards within development teams.",
        "Collaborated closely with the graphic designer and H TML coder to establish a clear dependency chain, resulting in a 20% reduction in development time and a 10% increase in overall code quality"
      ]
    },
    {
      "Tab": "IBDTD",
      "Title": "Software Engineer",
      "Date": "April 2014 - Mar 2016",
      "Description": [
        "Provided support for end users by resolving issues related to the deployed applications.",
        "Collaborated with other developers to integrate multiple systems through APIs.",
        "Maintained databases by writing S QL queries and stored procedures.",
        "Used AJAX to create interactive user experiences on websites with partial page updates.",
        "Collaborated with UI and UX designers to build intuitive user interfaces with modern design.",
        "Patterns like Material Design or Bootstrap 3.0+ frameworks.",
        "Developed and implemented ASP.NET web applications using C#, HTML, CSS, JavaScript, and jQuery.",
        "Implemented authentication methods such as Windows Authentication and Forms-based authentication for secure access to websites.",
        "Integrated third-party APIs into existing web applications.",
        "Configured IIS Web Server to host websites and applications.",
        "Developed custom websites to meet individual client needs.",
        "Created clean, well-documented custom code and updates."
      ]
    },
    {
      "Tab": "Jupiter System",
      "Title": "Web Developer",
      "Date": "Deember 2012 - March 2014",
      "Description": [
        "Developed and implemented ASP.NET web applications using C#, HTML, CSS, JavaScript jQuery.",
        "Developed custom websites to meet individual client needs.",
        "Created clean, well-documented custom code and updates.",
        "Built responsive layouts using media queries for mobile devices so that content is optimized across all platforms including tablets, and phones.",
        "Utilized SQL Server Management Studio to develop database objects like stored procedures, triggers, views, and functions.",
        "Used AJAX to create interactive user experiences on websites with partial page updates.",
        "Analyzed system requirements from business stakeholders to create technical specifications documents that meet customer needs.",
        "Created custom controls for web forms to provide a consistent look and feel across the entire website.",
        "Deployed websites onto IIS 7 and 8 servers using Visual Studio Team Services.",
        "Renewed domain name registrations.",
        "Recommended and implemented performance improvements.",
        "Performed and directed Web site updates.",
        "Backed up files from websites to local directories for instant recovery."
      ]
    },
    {
      "Tab": "MNS",
      "Title": "Jr. Software Developer",
      "Date": "October 2011 - November 2012",
      "Description": [
        "Researched new technologies and frameworks to improve existing systems.",
        "Performed unit testing on developed applications to ensure functionality before deployment.",
        "Evaluated third-party libraries and frameworks used in developing applications.",
        "Collaborated with other developers to design efficient solutions for programming problems.",
        "Maintained understanding of current web technologies and programming practices through continuing education and participation in professional conferences and workshops."
      ]
    }
  ],
  "FeatureProjects.Title": "Creative Projects that I was a part of",
  "FeatureProjects.Label": "Featured Project",
  "FeatureProjects.Projects": [
    {
      "Title": "Delmonte : Product Management and Sales Monitoring System",
      "Description": [
        "Web application for internal company management that covers sales, billing, and extensive and complex tracking departments, made with <span class='underline'>Angular</span> and <span class='underline'>Node.Js</span>."
      ],
      "imgs": [
        "assets/images/delmonte/Delmonte-101.png",
        "assets/images/delmonte/Delmonte-104.png",
        "assets/images/delmonte/Delmonte-107.png",
        "assets/images/delmonte/Delmonte-109.png",
        "assets/images/delmonte/Delmonte-111.png",
        "assets/images/delmonte/Delmonte-113.png",
        "assets/images/delmonte/Delmonte-116.png",
        "assets/images/delmonte/Delmonte-118.png",
        "assets/images/delmonte/Delmonte-121.png",
        "assets/images/delmonte/Delmonte-123.png",
        "assets/images/delmonte/Delmonte-126.png",
        "assets/images/delmonte/Delmonte-128.png",
        "assets/images/delmonte/Delmonte-130.png",
        "assets/images/delmonte/Delmonte-133.png",
        "assets/images/delmonte/Delmonte-135.png",
        "assets/images/delmonte/Delmonte-137.png",
        "assets/images/delmonte/Delmonte-140.png",
        "assets/images/delmonte/Delmonte-150.png"
      ],
      "Technologies": [
        "Angular 14",
        "HTML",
        "CSS",
        "Bootstrap",
        "SASS",
        "TypeScript",
        "RxJs",
        "Ng Form",
        "NGX Charts",
        "Git CI/CD",
        "ExpressJs",
        "NodeJs"
      ]
    },
    {
      "Title": "The KUBE : Digital Hospital Transformation",
      "Description": "Project aims to revolutionize the  <span class='underline'>healthcare</span> experience by developing a comprehensive digital platform for hospitals. This project will integrate cutting-edge web technologies to streamline hospital operations, enhance patient care, and optimize healthcare management processes.",
      "imgs": [
        "assets/images/kube/kube1.png",
        "assets/images/kube/kube2.png",
        "assets/images/kube/kube3.png",
        "assets/images/kube/kube4.png",
        "assets/images/kube/kube5.png"
      ],
      "Technologies": [
        "Angular 16",
        "HTML",
        "CSS",
        "Bootstrap",
        "SASS",
        "TypeScript",
        "RxJs",
        "Ng Form",
        "NGX Charts",
        "Sheetjs",
        "Git CI/CD",
        "ExpressJs",
        "NodeJs"
      ]
    },
    {
      "Title": "Moon Invoice :  Easy Invoice App",
      "Description": "<span class='underline'>Moon Invoice </span> is an innovative invoice application designed to streamline and optimize the invoicing process. This project was developed with a strong emphasis on collaboration, performance enhancement, and cutting-edge technologies. This projectaims to provide a seamless, efficient, and user-friendly invoicing solution, leveraging the latest technological advancements to meet the needs of modern businesses.",
      "imgs": [
        "assets/images/easyinvoice/easyinvoice1.gif",
        "assets/images/easyinvoice/easyinvoice2.gif",
        "assets/images/easyinvoice/easyinvoice3.gif",
        "assets/images/easyinvoice/easyinvoice4.png",
        "assets/images/easyinvoice/easyinvoice5.png"
      ],
      "Technologies": [
        "Angular 10",
        "HTML",
        "CSS",
        "Angular Material",
        "TypeScript",
        "RxJs",
        "Ng Form",
        "NGX Charts",
        "Web-Pack",
        "Angular Libraries",
        "PWA",
        "Service-worker"
      ]
    },
    {
      "Title": "Sales & Purchase CRM",
      "Description": "Health plan quote that has a search engine with which advanced queries are made. Plans are displayed based on the user's age, monthly income, and location. It has <span class='underline'>online chat</span, <span class='underline'>contact form</span>, <span class='underline'>notification system by whatsapp and mail</span>, <span class='underline'>auth</span>, and <span class='underline'>internet information management through the role of administrator.</span>",
      "imgs": [
        "assets/images/tusuperplan/tusuperplan1.png",
        "assets/images/tusuperplan/tusuperplan2.png",
        "assets/images/tusuperplan/tusuperplan3.png",
        "assets/images/tusuperplan/tusuperplan4.png",
        "assets/images/tusuperplan/tusuperplan5.png"
      ],
      "Technologies": [
        "HTML",
        "CSS",
        "Angular 10",
        "SCSS",
        "RxJS",
        "Ngx-Bootstrap",
        "Kendo-UI Angular",
        "Sheetjs",
        "File-Saver",
        "Git CI/CD"
      ]
    },
    {
      "Title": "Vehicle Lease Quote System",
      "Description": "Data monitoring platform belonging to water wells, tugboats, and various installations made from scratch with auth module, <span class='underline'>configurable graphics</span>, <span class='underline'>configurable alarms</span>, <span class='underline'>user management</span>, and <span class='underline'>geolocation with openlayers.</span>",
      "imgs": [
        "assets/images/proyex/proyex1.png",
        "assets/images/proyex/proyex2.png",
        "assets/images/proyex/proyex3.png",
        "assets/images/proyex/proyex4.png",
        "assets/images/proyex/proyex5.png",
        "assets/images/proyex/proyex6.png",
        "assets/images/proyex/proyex7.png",
        "assets/images/proyex/proyex8.png",
        "assets/images/proyex/proyex9.png",
        "assets/images/proyex/proyex10.png",
        "assets/images/proyex/proyex11.png",
        "assets/images/proyex/proyex12.png"
      ],
      "Technologies": [
        "Laravel",
        "Angular",
        "SASS",
        "Angular Material",
        "RxJS"
      ]
    },
    {
      "Title": "Sytner Digital Service Booking App",
      "Description": "The rock-paper-scissors game extended. A personal project developed in angular in which you play randomly against the machine. It has the use of services, interfaces, and components.",
      "imgs": [
        "assets/images/hands-game.png"
      ],
      "ghLink": "https://github.com/nikhiljanshali/hands-game",
      "demoLink": "https://projects.nikhiljanshali.com/hands-game",
      "Technologies": [
        "Angular",
        "CSS GRID",
        "SASS",
        "Angular animations"
      ]
    },
    {
      "Title": "Motor Gruppen Planner",
      "Description": "An interface that consumes an API of countries with which you can view a list of countries, see details of each country, filter by name and region. It also has a dark mode to switch between dark and light themes.",
      "imgs": [
        "assets/images/countries-viewer.png"
      ],
      "ghLink": "https://github.com/nikhiljanshali/countries-viewer",
      "demoLink": "https://projects.nikhiljanshali.com/countries-viewer",
      "Technologies": [
        "Angular",
        "RxJS",
        "SASS",
        "API"
      ]
    }
  ],
  "OtherProjects.Title": "More projects",
  "OtherProjects.Projects": [
    {
      "Title": "Pokemon",
      "Description": "Pokemon search engine that uses the pokeapi. Object-oriented programming was used to organize the information of the pokemons along with their respective image.",
      "ghLink": "https://github.com/nikhiljanshali/pokemon-angular",
      "demoLink": "https://projects.nikhiljanshali.com/pokemon-list",
      "Technologies": [
        "Angular",
        "RxJs",
        "API",
        "Bootstrap"
      ]
    },
    {
      "Title": "Coming soon page",
      "Description": "Personal project of a two-column split page to be used as a 'Coming soon page'. Scheduled to be a fully responsive design. It has a form field to subscribe by email.",
      "ghLink": "https://github.com/nikhiljanshali/coming-soon-page",
      "demoLink": "https://projects.nikhiljanshali.com/coming-soon-page",
      "Technologies": [
        "Angular",
        "SASS",
        "CSS GRID",
        "Reactive form"
      ]
    },
    {
      "Title": "Four card feature section",
      "Description": "A single page that has a minimal design, listing four features on four cards. Input animations are done with angular animations.",
      "ghLink": "https://github.com/nikhiljanshali/fourd-card-feature-section",
      "demoLink": "https://projects.nikhiljanshali.com/four-card-feature-section",
      "Technologies": [
        "Angular",
        "SASS",
        "CSS GRID"
      ]
    },
    {
      "Title": "Social proof section",
      "Description": "Personal project of a page designed from a Figma layout. Angular was used for development together with SASS and CSS GRID.",
      "ghLink": "https://github.com/nikhiljanshali/social-proof-section",
      "demoLink": "https://projects.nikhiljanshali.com/social-proof-section",
      "Technologies": [
        "Angular",
        "CSS GRID",
        "GIT"
      ]
    },
    {
      "Title": "FAQ accordion card",
      "Description": "FAQ accordion with logic and animations made in Angular.",
      "ghLink": "https://github.com/nikhiljanshali/faq-accordion",
      "demoLink": "https://proyectos.nikhiljanshali.com/faq-accordion",
      "Technologies": [
        "Angular",
        "CSS GRID",
        "Angular animations"
      ]
    },
    {
      "Title": "Profile card",
      "Description": "Simple one-page design that features a profile letter with basic information about a person.",
      "ghLink": "https://github.com/nikhiljanshali/profile-card-component",
      "demoLink": "https://proyectos.nikhiljanshali.com/profile-card-component",
      "Technologies": [
        "Angular",
        "SASS",
        "GIT"
      ]
    }
  ],
  "Contact.Pretitle": "What’s Next",
  "Contact.Title": "Get in touch!",
  "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
  "Contact.Btn": "Say Hello"
}
